8-barotropicFoam/testCase/CAA/0/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    ".*"
    {
        type            zeroGradient;
    }

    left
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        100000;
        psi             psi;
        lInf            5.0;
    }
    
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
