8-barotropicFoam/testCase/CAA/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          500;
        startFace       249250;
    }
    left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          250;
        startFace       249750;
    }
    right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          250;
        startFace       250000;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          500;
        startFace       250250;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          250000;
        startFace       250750;
    }
)

// ************************************************************************* //
