8-barotropicFoam/testCase/CAA/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(phi,U)      Gauss LUST grad(U);
    div(phi,p)      Gauss LUST grad(p);
    div(T(gradU))   Gauss linear;
    div((interpolate((psi*HbyA))&Sf),p)   Gauss linear;
    div((HbyA*(1-(psi*100000))))    Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

// ************************************************************************* //
